In [1]:
import pandas as pd

In [2]:
s_id = pd.Series(["01","02","03","04","05"])
s_class = pd.Series(["二班","一班","二班","三班","一班"])
s_grade = pd.Series([92,67,70,88,76])

df1 = pd.DataFrame({"学号":s_id,"班级":s_class,"成绩":s_grade})
df1

   学号  班级  成绩
0  01  二班  92
1  02  一班  67
2  03  二班  70
3  04  三班  88
4  05  一班  76

创建dataframe第一种方法

In [3]:
df2 = pd.DataFrame({"学号":{"小明":"01","小红":"02","小杰":"03","小丽":"04","小华":"05"},
                    "班级":{"小明":"二班","小红":"一班","小杰":"二班","小丽":"三班","小华":"一班"},
                    "成绩":{"小明":92,"小红":67,"小杰":70,"小丽":88,"小华":76}})
df2

    学号  班级  成绩
小明  01  二班  92
小红  02  一班  67
小杰  03  二班  70
小丽  04  三班  88
小华  05  一班  76

创建dataframe的第二种方法，字典嵌套字典，里层字典的键对应series的标签索引

In [4]:
df2.index

Index(['小明', '小红', '小杰', '小丽', '小华'], dtype='object')

index获取所有索引

In [5]:
df2.columns

Index(['学号', '班级', '成绩'], dtype='object')

columns获取所有列名

In [6]:
df2.values

array([['01', '二班', 92],
       ['02', '一班', 67],
       ['03', '二班', 70],
       ['04', '三班', 88],
       ['05', '一班', 76]], dtype=object)

获取所有值（返回为numpy数组）

In [7]:
df2.T

    小明  小红  小杰  小丽  小华
学号  01  02  03  04  05
班级  二班  一班  二班  三班  一班
成绩  92  67  70  88  76

T转置列表

In [8]:
print(df2['班级'])
print(df2.班级)

小明    二班
小红    一班
小杰    二班
小丽    三班
小华    一班
Name: 班级, dtype: object
小明    二班
小红    一班
小杰    二班
小丽    三班
小华    一班
Name: 班级, dtype: object

提取所有列（两种方法,列明若有空格或特殊符号则不能用方法二）

In [9]:
df2[['成绩','班级']]

    成绩  班级
小明  92  二班
小红  67  一班
小杰  70  二班
小丽  88  三班
小华  76  一班

提取多列，在方括号里传入多个属性值

In [10]:
print(df2.loc["小丽"])
print(df2.iloc[3])

学号    04
班级    三班
成绩    88
Name: 小丽, dtype: object
学号    04
班级    三班
成绩    88
Name: 小丽, dtype: object

提取行，loc（标签），iloc（位置）

In [11]:
print(df2.loc["小红":"小丽"])
print(df2.iloc[1:3])

    学号  班级  成绩
小红  02  一班  67
小杰  03  二班  70
小丽  04  三班  88
    学号  班级  成绩
小红  02  一班  67
小杰  03  二班  70

索引切片和series一样

In [12]:
print(df2.loc[["小丽","小红"]])
print(df2.iloc[[3,1]])

    学号  班级  成绩
小丽  04  三班  88
小红  02  一班  67
    学号  班级  成绩
小丽  04  三班  88
小红  02  一班  67

提取任意行

In [14]:
print(df2.loc["小杰","学号"])
print(df2.iloc[2,0])

03
03

提取dataframe里的某个元素（行，列）

In [15]:
print(df2.loc["小红":"小杰","班级":"成绩"])
print(df2.iloc[1:3,1:3])
print(df2.loc[:,"班级":"成绩"])
print(df2.iloc[:,1:3])

    班级  成绩
小红  一班  67
小杰  二班  70
    班级  成绩
小红  一班  67
小杰  二班  70
    班级  成绩
小明  二班  92
小红  一班  67
小杰  二班  70
小丽  三班  88
小华  一班  76
    班级  成绩
小明  二班  92
小红  一班  67
小杰  二班  70
小丽  三班  88
小华  一班  76

提取部分元素（行的切片，列的切片）

提取部分列，保留所有行（：表示默认提取所有所有）

In [24]:
print(df2.loc[["小红","小丽"], "学号":"班级"])
print(df2.iloc[[1,3],0:2])

    学号  班级
小红  02  一班
小丽  04  三班
    学号  班级
小红  02  一班
小丽  04  三班

提取不相邻元素的行or列

In [16]:
print(df2[df2["成绩"] > 80])
print(df2[df2.成绩 > 80])

    学号  班级  成绩
小明  01  二班  92
小丽  04  三班  88
    学号  班级  成绩
小明  01  二班  92
小丽  04  三班  88

筛选符合条件的行（行表示一个实例，而列表示每个实例的属性，所以是筛选行）

In [17]:
df2.head()

    学号  班级  成绩
小明  01  二班  92
小红  02  一班  67
小杰  03  二班  70
小丽  04  三班  88
小华  05  一班  76

head（）默认返回前五行，可以传入指定的行数值

In [18]:
df2.head(2)

    学号  班级  成绩
小明  01  二班  92
小红  02  一班  67

In [19]:
df1

   学号  班级  成绩
0  01  二班  92
1  02  一班  67
2  03  二班  70
3  04  三班  88
4  05  一班  76

## 以下是对dataframe的操作

In [20]:
df1["成绩"] = pd.Series([90, 91, 83, 95, 94])
df1

   学号  班级  成绩
0  01  二班  90
1  02  一班  91
2  03  二班  83
3  04  三班  95
4  05  一班  94

更新dataframe的一列值（更新一个series）（注：若索引有标签，那么series也要有标签才能和dataframe的索引对齐，否则全为NaN）

In [21]:
df1["成绩"]= [99,89,79,98,65]
df1

   学号  班级  成绩
0  01  二班  99
1  02  一班  89
2  03  二班  79
3  04  三班  98
4  05  一班  65

用Python的列表修改也行

In [22]:
df1["姓名"]= ["小明","小红","小刚","小丽","小李"]
df1

   学号  班级  成绩  姓名
0  01  二班  99  小明
1  02  一班  89  小红
2  03  二班  79  小刚
3  04  三班  98  小丽
4  05  一班  65  小李

若索引之前没有，会自动新建一个

In [23]:
df1.loc[0] = pd.Series(["01","三班",88,"小明"], index=["学号","班级","成绩","姓名"])
df1

   学号  班级  成绩  姓名
0  01  三班  88  小明
1  02  一班  89  小红
2  03  二班  79  小刚
3  04  三班  98  小丽
4  05  一班  65  小李

修改行，也要记得加索引标签，否则全为NAN

In [25]:
df1.loc[0] = ["01","三班",78,"小明"]
df1

   学号  班级  成绩  姓名
0  01  三班  78  小明
1  02  一班  89  小红
2  03  二班  79  小刚
3  04  三班  98  小丽
4  05  一班  65  小李

用列表更省事，直接按顺序对齐

In [27]:
df1.loc[5] = pd.Series(["06","三班",88,"小将"], index=["学号","班级","成绩","姓名"])
df1.loc[6] = ["07","三班",78,"小月"]
df1

   学号  班级  成绩  姓名
0  01  三班  78  小明
1  02  一班  89  小红
2  03  二班  79  小刚
3  04  三班  98  小丽
4  05  一班  65  小李
5  06  三班  88  小将
6  07  三班  78  小月

创建一行的两种方法（注：iloc无效）

In [49]:
print(df1.drop(3))
print(df1.drop([5,6]))

   学号  班级    成绩  姓名
0  01  三班  78.0  小明
1  02  一班  89.0  小红
2  03  二班  79.0  小刚
4  05  一班  65.0  小李
5  06  三班  88.0  小将
6  07  三班  78.0  小月
   学号  班级    成绩  姓名
0  01  三班  78.0  小明
1  02  一班  89.0  小红
2  03  二班  79.0  小刚
3  04  三班  98.0  小丽
4  05  一班  65.0  小李

删除一行用drop方法，删除多行用列表,不改变原dataframe

In [52]:
print(df1.drop("学号",axis=1))
print(df1.drop(["学号","班级"], axis=1))

   班级    成绩  姓名
0  三班  78.0  小明
1  一班  89.0  小红
2  二班  79.0  小刚
3  三班  98.0  小丽
4  一班  65.0  小李
5  三班  88.0  小将
6  三班  78.0  小月
     成绩  姓名
0  78.0  小明
1  89.0  小红
2  79.0  小刚
3  98.0  小丽
4  65.0  小李
5  88.0  小将
6  78.0  小月

删除一列用drop（"列名", axis=1）(axis是轴线的意思，0位纵向操作，1是横向操作)

# 以下是dataframe之间的操作

In [54]:
df1.add(df1, fill_value=0)

     学号    班级     成绩    姓名
0  0101  三班三班  156.0  小明小明
1  0202  一班一班  178.0  小红小红
2  0303  二班二班  158.0  小刚小刚
3  0404  三班三班  196.0  小丽小丽
4  0505  一班一班  130.0  小李小李
5  0606  三班三班  176.0  小将小将
6  0707  三班三班  156.0  小月小月

加减乘除add，sub，mul，div和series一样，相同的进行操作，缺少的是NAN，但是可以用fillvalue填充

# dataframe和series进行操作（series的索引和dataframe的列名对齐，然后把操作运用在dataframe的每一行上对齐不了的就是NAN）

In [62]:
s1 = pd.Series([0.1,0.2,0.3,0.4,0.5], index=["a","b","c","成绩","e"])
s1 * df1

    a   b   c   e   姓名   学号    成绩   班级
0 NaN NaN NaN NaN  NaN  NaN  31.2  NaN
1 NaN NaN NaN NaN  NaN  NaN  35.6  NaN
2 NaN NaN NaN NaN  NaN  NaN  31.6  NaN
3 NaN NaN NaN NaN  NaN  NaN  39.2  NaN
4 NaN NaN NaN NaN  NaN  NaN  26.0  NaN
5 NaN NaN NaN NaN  NaN  NaN  35.2  NaN
6 NaN NaN NaN NaN  NaN  NaN  31.2  NaN

In [65]:
5 * df1[["成绩","学号"]]

      成绩          学号
0  390.0  0101010101
1  445.0  0202020202
2  395.0  0303030303
3  490.0  0404040404
4  325.0  0505050505
5  440.0  0606060606
6  390.0  0707070707

In [71]:
df3 = pd.DataFrame({"选手1":{"001":100,"002":232,"003":333},
                   "选手2":{"001":3.44,"002":32998,"003":5.365},
                    "选手3":{"001":3423.3,"002":114514,"003":520}})
df3

     选手1        选手2       选手3
001  100      3.440    3423.3
002  232  32998.000  114514.0
003  333      5.365     520.0

In [74]:
print(df3.mean())
print(df3.max())
print(df3.min())
print(df3.sum())

选手1      221.666667
选手2    11002.268333
选手3    39485.766667
dtype: float64
选手1       333.0
选手2     32998.0
选手3    114514.0
dtype: float64
选手1    100.00
选手2      3.44
选手3    520.00
dtype: float64
选手1       665.000
选手2     33006.805
选手3    118457.300
dtype: float64

In [75]:
print(df3.mean(axis=1))
print(df3.max(axis=1))
print(df3.min(axis=1))
print(df3.sum(axis=1))

001     1175.580000
002    49248.000000
003      286.121667
dtype: float64
001      3423.3
002    114514.0
003       520.0
dtype: float64
001      3.440
002    232.000
003      5.365
dtype: float64
001      3526.740
002    147744.000
003       858.365
dtype: float64

以上为分别对列与对行进行求平均，求最大最小，求和

In [79]:
def pingjun(num):
    num_len = len(num) - 2
    num_max = num.max()
    num_min = num.min()
    num_sum = num.sum()
    return (num_sum - num_max - num_min) / num_len
    
print(df3.apply(pingjun))
print(df3.apply(pingjun, axis=1))

选手1     232.000
选手2       5.365
选手3    3423.300
dtype: float64
001      100.0
002    32998.0
003      333.0
dtype: float64

apply方法

In [82]:
df3.map(lambda x : x + 5)

     选手1        选手2       选手3
001  105      8.440    3428.3
002  237  33003.000  114519.0
003  338     10.365     525.0

map方法是对所有元素进行操作

In [85]:
df3.describe()

              选手1           选手2            选手3
count    3.000000      3.000000       3.000000
mean   221.666667  11002.268333   39485.766667
std    116.843200  19048.862422   64992.569849
min    100.000000      3.440000     520.000000
25%    166.000000      4.402500    1971.650000
50%    232.000000      5.365000    3423.300000
75%    282.500000  16501.682500   58968.650000
max    333.000000  32998.000000  114514.000000

自动统计非数字列信息